# `read_csv()` header parameter

In [1]:
import pandas as pd

## 1. Normal read

In [2]:
df_student = pd.read_csv("./datasets/students_score_no_header.csv")

In [3]:
df_student

  Unnamed 0   Score Unnamed 2
0      Name   Score    Grades
1      Paul      98        AA
2     Aaron      89        AB
3    Krista      99        AA
4  Veronica      87        AC
5    Paxton      90        AB
6   Madison      83        BA
7    Aurora      82        BB

## 2. Using `header=1`

In [4]:
df_student = pd.read_csv("./datasets/students_score_no_header.csv", header=1)

In [5]:
df_student

       Name   Score  Grades
0      Paul      98      AA
1     Aaron      89      AB
2    Krista      99      AA
3  Veronica      87      AC
4    Paxton      90      AB
5   Madison      83      BA
6    Aurora      82      BB

## 3. Using `header=None`

In [6]:
df_student = pd.read_csv("./datasets/students_score_no_header.csv", header=None)

In [7]:
df_student

           0       1          2
0  Unnamed 0   Score  Unnamed 2
1       Name   Score     Grades
2       Paul      98         AA
3      Aaron      89         AB
4     Krista      99         AA
5   Veronica      87         AC
6     Paxton      90         AB
7    Madison      83         BA
8     Aurora      82         BB